# Напишіть функцію sequence_buttons, що показує послідовність кнопок, яку необхідно 
# натиснути, щоб на екрані телефону з'явився текст, введений користувачем.

# Створіть словник, який відповідає символам з кнопками, які потрібно натиснути.

# Приклад: якщо функції sequence_buttons передати рядок "Hello, World!", функція 
# повинна повернути "4433555555666110966677755531111".

# Вимоги:

# функція коректно обробляє малі та великі літери.
# функція ігнорує символи, що не входять до зазначеного списку


def sequence_buttons(string):
    dict = {
            "1":".,?!:",
            "2":"ABC",
            "3":"DEF",
            "4":"GHI",
            "5":"JKL",
            "6":"MNO",
            "7":"PQRS",
            "8":"TUV",
            "9":"WXYZ",
            "0":" "
            } 
    rslt = ""
    for i in string:
        for k, v in dict.items():
            if i.upper() in v:
                rslt += k*(v.index(i.upper()) + 1)
    return rslt

string =  "Hello"
print(sequence_buttons(string))

