# Підсписком (sublist) називають список, що є складовою більшого списку. Підсписок може 
# містити один елемент, множину елементів або бути порожнім.

# Наприклад, [1], [2], [3] та [4] є підсписками списку [1, 2, 3, 4]. Список [2, 3] також 
# входить до складу [1, 2, 3, 4], але при цьому список [2, 4] не є підсписком [1, 2, 3, 4], 
# оскільки у вихідному списку числа 2 і 4 не є сусідами.

# Порожній список є підсписком будь-якого списку.
# Напишіть функцію all_sub_lists, що повертає список, який містить всі можливі підсписки заданого.

# Наприклад, якщо функції передано аргумент список [1, 2, 3], то функція має повернути наступний 
# список: [[], [1], [2], [3], [1, 2], [2, 3], [1, 2, 3]].

# Функція all_sub_lists повинна повертати щонайменше один список з порожнім підсписком [[]].


def all_sub_lists(data):
    sub_lists = [[]]
    for length in range(len(data)):  # length - довжина підсписку (1 символьний, 2 символьний і тд.)
        for num in range(len(data) - length):  # к-ть length-символьних варіантів варіантів
            sub_lists.append(data[num:num+length+1]) 
    return sub_lists

print(all_sub_lists([1, 2, 3, 4]))