# У четвертому модулі розв'язували завдання нормалізації даних. Розширимо її.

# При аналізі даних часто виникає необхідність позбавитися екстремальних значень, 
# перш ніж почати працювати з даними далі. Напишіть функцію data_preparation, яка 
# приймає набір даних, список списків (Приклад: [[1,2,3],[3,4], [5,6]]).

# Функція повинна видаляти з переданих списків найбільше і найменше значення, але 
# якщо розмір списку понад два елементи. Після видалення даних з кожного списку 
# необхідно злити їх разом в один список, відсортувати його за зменшенням та повернути 
# отриманий список як результат (Для прикладу вище результат буде наступним: [6, 5, 4, 3, 2]).


def data_preparation(list_data):
    rslt = []
    for l in list_data:
        if len(l) > 2:
            l = sorted(l)[1:-1]
        rslt.extend(l)
    rslt.sort(reverse=True)        
    return rslt

list_data = [[1,22,3,4], [12,23,23,23,23, 1, 2]]
print(data_preparation(list_data))

    
        
            
            