# Рекурсія добре підходить до задачі flatentening. Це процес вирівнювання списків, 
# який полягає в позбавленні вкладеної структури. Наприклад список вигляду [1, 2, [3, 4, [5, 6]], 7] 
# має бути перетворений на плоский (flat) список [1, 2, 3, 4, 5, 6, 7]

# Напишіть функцію flatten, яка приймає на вхід список, рекурсивно вирівнюватиме цей список і повертатиме пласку версію списку.


def flatten(data):
    rslt = []
    for item in data:
        if isinstance(item, list):
            rslt.extend(flatten(item))
        else:
            rslt.append(item)
    return rslt

lst = [[1], 2, [3, 4, [5, 6]], 7]
print(flatten(lst))