# При роботі веб-сервісів спілкування, за протоколом HTTP, найчастіше відбувається в форматі JSON. 
# І надсилання даних на сервер при запиті POST - це необхідність використовувати словник, оскільки 
# структура формату JSON ідентична словнику Python.

# Реалізуйте допоміжну функцію, яка формуватиме запит на сервер у вигляді словника. Дана функція 
# make_request(keys, values) приймає два параметри у вигляді списків. Функція повинна створити 
# словник із ключами з списку keys та значеннями зі списку values.

# Порядок відповідності збігається з індексами списків keys та values.
# Якщо довжина keys та values не збігаються, поверніть порожній словник.

def make_request(keys, values):
    request = {}
    if len(keys) != len(values): return request
    for num, k in enumerate(keys):
        request[k] = values[num]
    return request


keys = [1, 2, 3, 4, 5]
values = ["1a", "2b", "3c", "4d", "0O"]
print(make_request(keys, values))      
    
        