# Повернемося до попереднього завдання та виконаємо зворотне. Напишіть рекурсивну функцію 
# encode для кодування списку або рядка. Як аргумент функція приймає список ( наприклад 
# ["X", "X", "X", "Z", "Z", "X", "X", "Y", "Y", "Y", "Z", "Z" ]) або рядок (наприклад, "XXXZZXXYYYZZ"). 
# Функція повинна повернути закодований список елементів (наприклад ["X", 3, "Z", 2, "X", 2, "Y", 3, "Z", 2]).


def encode(data):
    if not data:
        return []
    count = 1
    f = data[0]

    for i in data[1:]:
        if i == f:
            count += 1
        else:
            break

    return [f, count] + encode(data[count:])
    

lst = [  "X", "X", "X", "Z", "Z", "X", "X", "Y", "Y", "X", "Z"]
print(encode(lst))
